// 정리.cpp

// C++ 언어를 통해서 배워야 하는 것들

// #1. non-oop 문법
// 변수, 함수, 제어문, 반복문등의 프로그래밍 관용구관련 다양한 C++ 문법 - 1일차 7교시까지
// => auto, {}초기화, decltype
// => defalut parameter, overloading, template, inline
// => range-for
// => reference
// => C++ explicit casting
// => new, delete
//--------------------------------------------
// #2. 객체지향(OOP) 개념과 클래스 문법 - 1일차 8교시 ~ 

// #3. 상속 문법과 객체지향 디자인(약간소개, 자세한 것은 별도 과정)

// #4. C++ 표준 라이브러리(STL) 사용법 - 3일차 오후 정도에 간략히 소개

// #5. 예외, 연산자 재정의 등의 문법 소개 - 3일차 오전

