// 정리.cpp

// C++ 언어를 통해서 배워야 하는 것들

// #1. non-oop 문법
// 변수, 함수, 제어문, 반복문등의 프로그래밍 관용구관련 다양한 C++ 문법 - 1일차 6교시까지
// => auto, {}초기화, decltype
// => defalut parameter, overloading, template, inline
// => range-for
// => reference
// => C++ explicit casting
// => new, delete
//--------------------------------------------

// #2. 객체지향(OOP) 개념과 클래스 문법 - 1일차 7교시 ~ 

// => 객체 지향 프로그래밍은 결국 "타입"을 만들어서 사용하자는 것
//    std::string, std::vector 등의 타입이 있으므로 프로그램 작성이 쉬워진다

// => "타입을 만드는 방법" 과 "이미 만들어진 타입을 사용하는 법" 을 배우는 것

// => 타입을 만드는 방법 을 배우는 것이 class 문법을 배우는 것

// 1. 접근 지정자 : private, public
// 2. 생성자와 소멸자 개념 
// 3. 멤버 초기화 리스트
// 4. this 개념
// 5. const member function
// 6. static member
// ==> 클래스(타입) 한개를 만들때 필요 한것
// ==> 위 내용을 모두 알면 Date 같은 클래스 한개를 만들수 있다.

//----------------------------------------------------
// #3. 상속 문법과 객체지향 디자인(약간소개, 자세한 것은 별도 과정)

// 1. 상속 문법 기본 개념
// 2. upcasting 이야기 - vector<Shape*>
// 
// 3. 가상함수 - 문법특징, 왜 사용하나요 ?? Shape 예제.
//    static binding, dynamic binding
// 
// 4. 다형성, OCP
// 
// 5. 추상 클래스, 인터페이스

// ==> 한개가 아닌 여러개 클래스들의 관계를 설정하는 방법을 배우는 것
// ==> 규칙을 먼저 설계하고, 규칙 대로 사용하자는 것

// ==> 나중에 "디자인 패턴"을 꼭 공부해 보세요
//     OCP 같은 개념을 아주 많이 배울수 있습니다.


// #4. 연산자 재정의 등의 문법 소개 - 3일차 오전


// #5. C++ 표준 라이브러리(STL) 사용법 - 3일차 오후 정도에 간략히 소개

// #6. 예외 이야기..  



