// 정리.cpp - 어제 정리.cpp 복사

// C++ 언어를 통해서 배워야 하는 것들

// #1. non-oop 문법
// 변수, 함수, 제어문, 반복문등의 프로그래밍 관용구관련 다양한 C++ 문법 - 1일차 6교시까지
// => auto, {}초기화, decltype
// => defalut parameter, overloading, template, inline
// => range-for
// => reference
// => C++ explicit casting
// => new, delete
//--------------------------------------------

// #2. 객체지향(OOP) 개념과 클래스 문법 - 1일차 7교시 ~ 

// => 객체 지향 프로그래밍은 결국 "타입"을 만들어서 사용하자는 것
//    std::string, std::vector 등의 타입이 있으므로 프로그램 작성이 쉬워진다

// => "타입을 만드는 방법" 과 "이미 만들어진 타입을 사용하는 법" 을 배우는 것

// => 타입을 만드는 방법 을 배우는 것이 class 문법을 배우는 것

// 1. 접근 지정자 : private, public

// 2. 생성자와 소멸자 개념 

// 3. 멤버 초기화 리스트

// 4. this 개념

// 5. const member function

// 6. static member







//----------------------------------------------------
// #3. 상속 문법과 객체지향 디자인(약간소개, 자세한 것은 별도 과정)

// #4. C++ 표준 라이브러리(STL) 사용법 - 3일차 오후 정도에 간략히 소개

// #5. 예외, 연산자 재정의 등의 문법 소개 - 3일차 오전
